In [1]:
import numpy as np
import pandas as pd

In [2]:
titanic = pd.read_csv("titanic.csv")

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [4]:
# Какое количество мужчин и женщин ехало на корабле?

In [5]:
males = titanic[titanic["Sex"] == "male"]

In [6]:
males.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,NaN,S

In [11]:
len(males.index)

577

In [16]:
females = titanic[titanic["Sex"] == "female"]

In [17]:
females.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,NaN,C

In [18]:
len(females.index)

314

In [19]:
# Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров.

In [20]:
survived = titanic[titanic['Survived'] == 1]

In [21]:
survived.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,NaN,C

In [22]:
len(survived.index)

342

In [25]:
float(len(survived.index)) / len(titanic.index) * 100

38.38383838383838

In [26]:
# Какую долю пассажиры первого класса составляли среди всех пассажиров?

In [27]:
first_class = titanic[titanic['Pclass'] == 1]

In [28]:
float(len(first_class.index)) / len(titanic.index) * 100

24.242424242424242

In [29]:
# Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров.

In [30]:
ages = titanic['Age']

In [31]:
ages.head()

0    22
1    38
2    26
3    35
4    35
Name: Age, dtype: float64

In [45]:
ages.mean()

29.69911764705882

In [46]:
# Коррелируют ли число братьев/сестер/супругов с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.

In [47]:
sibsp = titanic['SibSp']

In [48]:
parch = titanic['Parch']

In [52]:
titanic[['SibSp', 'Parch']].corr(method = 'pearson')

          SibSp     Parch
SibSp  1.000000  0.414838
Parch  0.414838  1.000000

In [53]:
# Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name).

In [59]:
female_names = titanic[titanic['Sex'] == 'female'].Name

In [77]:
female_names.head()

1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [78]:
female_names.get_value(1).__class__

str

In [86]:
female_names_without_surname = [s.partition(',')[2] for s in female_names.get_values()]

In [101]:
female_names_without_surname = pd.Series(female_names_without_surname)

In [102]:
female_names_without_surname.head()

0     Mrs. John Bradley (Florence Briggs Thayer)
1                                    Miss. Laina
2             Mrs. Jacques Heath (Lily May Peel)
3       Mrs. Oscar W (Elisabeth Vilhelmina Berg)
4                    Mrs. Nicholas (Adele Achem)
dtype: object

In [107]:
female_names_clean = female_names_without_surname.apply(lambda x: x.split(' ')[2])

In [112]:
female_names_counts = female_names_clean.value_counts()

In [114]:
female_names_counts.index

Index([u'William', u'Mary', u'Anna', u'Thomas', u'John', u'Elizabeth',
       u'Margaret', u'Frederick', u'Alice', u'Helen',
       ...
       u'Lyyli', u'(Ada', u'Sinai', u'Ruth', u'(Beila)', u'Eliina',
       u'Dickinson', u'Leontine', u'Harvey', u'Richard'],
      dtype='object', length=203)

In [ ]:
female_names_start_with_Mar = [s for s in female_names_counts.index if (s.startswith('Marg') and s.startswith('Marg'))]

In [151]:
female_Mary_names = [s for s in female_names_counts.index if (s.startswith('Mar') and (not s.startswith('Marg')))]

In [154]:
female_names_counts[female_Mary_names].sum()

21